project02/depot/app/controllers/info_controller.rb

  def who_bought
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)